def convert_to_thai_month(input_month):
    thai_month ={
                    '01': 'ม.ค.',
                    '02': 'ก.พ.',
                    '03': 'มี.ค.',
                    '04': 'เม.ย.',
                    '05': 'พ.ค.',
                    '06': 'มิ.ย.',
                    '07': 'ก.ค.',
                    '08': 'ส.ค.',
                    '09': 'ก.ย.',
                    '10': 'ต.ค.',
                    '11': 'พ.ย.',
                    '12': 'ธ.ค.'
                 }
    return thai_month[input_month]

def convert_thai_month(thai_months):
    month = {
                    'มกราคม': '01', 'ม.ค.': '01',
                    'กุมภาพันธ์': '02', 'ก.พ.': '02',
                    'มีนาคม': '03', 'มี.ค.': '03',
                    'เมษายน': '04', 'เม.ย.': '04',
                    'พฤษภาคม': '05', 'พ.ค.': '05',
                    'มิถุนายน': '06', 'มิ.ย.': '06',
                    'กรกฎาคม': '07', 'ก.ค.': '07',
                    'สิงหาคม': '08', 'ส.ค.': '08',
                    'กันยายน': '09', 'ก.ย.': '09',
                    'ตุลาคม': '10', 'ต.ค.': '10',
                    'พฤศจิกายน': '11', 'พ.ย.': '11',
                    'ธันวาคม': '12', 'ธ.ค.': '12'
    }
    return month[thai_months]